<template>
    <div>
        <header class="header">
            <div v-if="banerimage.imgurl">
                <img v-lazy="banerimage.imgurl"  alt="" @click="toDetail" class="imgurls">
            </div>
        </header>
        <div style="float: left;margin: 0.8rem 0 0;">
          <span style="font-size:14px;font-weight: 700;color: #000;">热卖分类</span>
        </div>
        <nav class="nav">

          <div v-if="recommendList" v-for="(item,index) in recommendList" :key="item.id"
               @click="toSubmenu(item.id)"
          >
            <div class="nav_img">
<!--              {{imgurl+zidian[item.image]+'.jpg'}}{{item.image}}-->
              <img :src="imgurl+zidian[item.image]+'.jpg'" alt="">

            </div>
            <div style="color: #000;font-size: 14px;line-height: 1rem;">
              <span>{{item.label}}</span>
            </div>
          </div>

        </nav>
    </div>
</template>
<script>
export default {
    props:{
        recommendList:{
            type:Array,
            default:[]
        },
        banerimage:{
            type:Object,
            default:{}
        }
    },
    data(){
      return{
          imgurl:"./static/towci/",
          zidian:{'3D打印.jpg':0,'3D绘图.jpg':1,'BB霜.jpg':2,'CD播放器.jpg':3,'IP卫衣.jpg':4,'led光源.jpg':5,'MP3MP4.jpg':6,'OPPO手机.jpg':7,'polo.jpg':8,'T恤.jpg':9,'USB周边.jpg':10,'U盘.jpg':11,'vivo手机.jpg':12,'一字带凉鞋.jpg':13,'一次性杯子.jpg':14,'一次性餐具.jpg':15,'三星手机.jpg':16,'丑橘.jpg':17,'世界名庄酒.jpg':18,'丝巾.jpg':19,'丝袜.jpg':20,'个人清洁.jpg':21,'个性徽章.jpg':22,'中秋礼品盒.jpg':23,'中老年女装.jpg':24,'中耳炎.jpg':25,'主题乐园.jpg':26,'乌龙茶.jpg':27,'乐器玩具.jpg':28,'乒乓球.jpg':29,'书法画材.jpg':30,'乳液面霜.jpg':31,'乳清蛋白.jpg':32,'乳贴.jpg':33,'二极管.jpg':34,'五谷杂粮.jpg':35,'五金工具箱.jpg':36,'交换机.jpg':37,'产后塑身.jpg':38,'产妇帽.jpg':39,'产妇洗发.jpg':40,'亲子酒店.jpg':41,'人参.jpg':42,'仓储货架.jpg':43,'代餐粉.jpg':44,'仰卧板.jpg':45,'仿真绿植.jpg':46,'企业U盘.jpg':47,'企业VI.jpg':48,'企业服标垫.jpg':49,'企业箱包.jpg':50,'休闲套装.jpg':51,'休闲短裤.jpg':52,'休闲裤.jpg':53,'休闲长裤.jpg':54,'休闲鞋.jpg':55,'会议桌椅.jpg':56,'会议笔记本.jpg':57,'传动带.jpg':58,'传动链.jpg':59,'传统台钓.jpg':60,'伴手礼.jpg':61,'体检.jpg体检.png':62,'体温计.jpg':63,'体重秤.jpg':64,'保健按摩.jpg':65,'保健酒.jpg':66,'保暖内衣.jpg':67,'保暖用品.jpg':68,'保鲜器皿.jpg':69,'保龄球.jpg':70,'修容.jpg':71,'修车工具.jpg':72,'偏头痛.jpg':73,'健腹轮.jpg':74,'健身增肌.jpg':75,'健身服装.jpg':76,'健身车.jpg':77,'儿童T恤.jpg':78,'儿童三轮车.jpg':79,'儿童书包.jpg':80,'儿童内衣裤.jpg':81,'儿童凉拖.jpg':82,'儿童外套.jpg':83,'儿童套装.jpg':84,'儿童奶.jpg':85,'儿童家居服.jpg':86,'儿童床品.jpg':87,'儿童护具.jpg':88,'儿童智能表.jpg':89,'儿童校服.jpg':90,'儿童桌椅.jpg':91,'儿童水杯.jpg':92,'儿童泳衣裤.jpg':93,'儿童洗衣液.jpg':94,'儿童润肤乳.jpg':95,'儿童演出服.jpg':96,'儿童牙刷.jpg':97,'儿童电动车.jpg':98,'儿童皮鞋.jpg':99,'儿童羽绒服.jpg':100,'儿童自行车.jpg':101,'儿童舞蹈鞋.jpg':102,'儿童衬衫.jpg':103,'儿童袜子.jpg':104,'儿童裙子.jpg':105,'儿童裤子.jpg':106,'儿童运动鞋.jpg':107,'儿童配饰.jpg':108,'儿童防晒衣.jpg':109,'儿童靴子.jpg':110,'儿童餐具.jpg':111,'儿童餐椅.jpg':112,'充电宝.jpg':113,'光学眼镜.jpg':114,'光纤耦合器.jpg':115,'光纤跳线.jpg':116,'公司名片.jpg':117,'其他安装维修.jpg':118,'养生茶.jpg':119,'养鸡饮水器.jpg':120,'兽药.jpg':121,'农用机械.jpg':122,'农用杀菌剂.jpg':123,'农用薄膜.jpg':124,'冠心病.jpg':125,'冬虫夏草.jpg':126,'冰淇淋.jpg':127,'冰箱冷柜.jpg':128,'冻疮烫伤.jpg':129,'净水器.jpg':130,'凉席蚊帐.jpg':131,'凉拖.jpg':132,'凤梨.jpg':133,'刀具砧板.jpg':134,'分体塑身.jpg':135,'分离设备.jpg':136,'划船机.jpg':137,'创意摆件.jpg':138,'创意礼品.jpg':139,'前台接待.jpg':140,'剪刀.jpg':141,'办公室铭牌.jpg':142,'办公柜.jpg':143,'办公桌椅.jpg':144,'动漫周边.jpg':145,'包装纸箱.jpg':146,'包装胶带.jpg':147,'包车出游.jpg':148,'化妆工具.jpg':149,'化妆水.jpg':150,'化工管道.jpg':151,'医用面膜.jpg':152,'医药卫生.jpg':153,'半身裙.jpg':154,'华为手机.jpg':155,'单反镜头.jpg':156,'卡包.jpg':157,'卫浴淋浴.jpg':158,'卫生巾.jpg':159,'卫衣.jpg':160,'卫裤.jpg':161,'即食燕窝.jpg':162,'卷尺.jpg':163,'卸妆.jpg':164,'压力表.jpg':165,'厨房储物.jpg':166,'厨房卫浴安装维修.jpg':167,'厨房小工具.jpg':168,'厨房小电器.jpg':169,'厨房架类.jpg':170,'厨房清洁.jpg':171,'厨房纸巾.jpg':172,'厨房置物架.jpg':173,'双肩背包.jpg':174,'反光安全服.jpg':175,'发廊家具.jpg':176,'发电机.jpg':177,'发饰.jpg':178,'取暖器.jpg':179,'变压器.jpg':180,'变频器.jpg':181,'口水巾.jpg':182,'口红.jpg':183,'口腔护理.jpg':184,'口腔清洁.jpg':185,'古筝.jpg':186,'台历挂历.jpg':187,'台灯.jpg':188,'台球.jpg':189,'台盆.jpg':190,'叶菜.jpg':191,'叶酸.jpg':192,'叶黄素.jpg':193,'吉他.jpg':194,'吊灯.jpg':195,'名酒礼盒.jpg':196,'吸奶器.jpg':197,'吸尘器.jpg':198,'吸油纸.jpg':199,'吸顶灯.jpg':200,'员工胸牌.jpg':201,'呼吸用药.jpg':202,'和田玉.jpg':203,'咖啡.jpg':204,'咖啡器具.jpg':205,'咖啡机.jpg':206,'咸鸭蛋.jpg':207,'品质腰带.jpg':208,'品质茶具.jpg':209,'哈密瓜.jpg':210,'哈衣爬服.jpg':211,'哑铃.jpg':212,'哮喘.jpg':213,'哺乳文胸.jpg':214,'哺乳装.jpg':215,'商业设备.jpg':216,'商务服务.jpg':217,'商标设计.jpg':218,'商用展示柜.jpg':219,'啤酒.jpg':220,'喂哺.jpg':221,'喉咙肿痛.jpg':222,'喜糖.jpg':223,'喜饼诞生礼.jpg':224,'团队服装.jpg':225,'园艺肥料.jpg':226,'围巾.jpg':227,'围裙.jpg':228,'国产白酒.jpg':229,'国产腕表.jpg':230,'国风汉服.jpg':231,'地板.jpg':232,'地毯地垫.jpg':233,'坐便器.jpg':234,'垃圾处理器.jpg':235,'垃圾清理.jpg':236,'塑料包装袋.jpg':237,'塑身腰封.jpg':238,'墙纸背景墙.jpg':239,'墙面装饰.jpg':240,'墨盒硒鼓.jpg':241,'壁球.jpg':242,'复合维生素.jpg':243,'多肉植物.jpg':244,'大牌女包.jpg':245,'大码女装.jpg':246,'大米.jpg':247,'大蒜.jpg':248,'太极.jpg':249,'太阳镜.jpg':250,'头发造型.jpg':251,'头枕腰靠.jpg':252,'奖杯奖牌.jpg':253,'奖状证书.jpg':254,'女切尔西靴.jpg':255,'女士乐福鞋.jpg':256,'女士内裤.jpg':257,'女士凉鞋.jpg':258,'女士单肩包.jpg':259,'女士单鞋.jpg':260,'女士卫衣.jpg':261,'女士奶奶鞋.jpg':262,'女士帆布包.jpg':263,'女士帆布鞋.jpg':264,'女士手拿包.jpg':265,'女士手提包.jpg':266,'女士斜挎包.jpg':267,'女士泳衣.jpg':268,'女士玛丽珍.jpg':269,'女士真皮包.jpg':270,'女士穆勒鞋.jpg':271,'女士罗马鞋.jpg':272,'女士腰带.jpg':273,'女士豆豆鞋.jpg':274,'女士运动鞋.jpg':275,'女士雨鞋.jpg':276,'女士雪地靴.jpg':277,'女士马丁靴.jpg':278,'女士高跟鞋.jpg':279,'奶嘴牙胶.jpg':280,'奶瓶.jpg':281,'奶瓶配件.jpg':282,'奶粉.jpg':283,'奶酪零食.jpg':284,'妈咪包.jpg':285,'妊娠纹护理.jpg':286,'姜汤冲饮.jpg':287,'婚庆用品.jpg':288,'婴儿健身器.jpg':289,'婴儿凉席.jpg':290,'婴儿奶粉.jpg':291,'婴儿床.jpg':292,'婴儿推车.jpg':293,'婴儿沐浴露.jpg':294,'婴儿湿巾.jpg':295,'婴儿睡袋.jpg':296,'婴儿米粉.jpg':297,'婴儿肚兜.jpg':298,'婴儿蚊帐.jpg':299,'婴儿防撞.jpg':300,'婴幼儿维生素.jpg':301,'婴幼儿营养.jpg':302,'孕产妇彩妆.jpg':303,'孕产妇护肤.jpg':304,'孕产妇营养.jpg':305,'孕妇内衣裤.jpg':306,'孕妇装.jpg':307,'学步车.jpg':308,'学步鞋.jpg':309,'安全座椅.jpg':310,'安全网.jpg':311,'定制衣柜.jpg':312,'宝宝个护.jpg':313,'宝宝洗护.jpg':314,'宝宝纪念品.jpg':315,'宝宝罩衣.jpg':316,'宝宝营养品.jpg':317,'宝宝防晒.jpg':318,'宝宝零食.jpg':319,'宝石.jpg':320,'实木沙发.jpg':321,'家具拆装.jpg':322,'家居服套装.jpg':323,'家庭影院.jpg':324,'家政服务.jpg':325,'家用制氧机.jpg':326,'家用刷.jpg':327,'家用小电器.jpg':328,'家用工具.jpg':329,'家用贴饰.jpg':330,'家用钟饰.jpg':331,'家用门配件.jpg':332,'家装除味.jpg':333,'宽带办理.jpg':334,'密封件.jpg':335,'封口机.jpg':336,'小方包.jpg':337,'小米10.jpg':338,'小米手机.jpg':339,'尿裤.jpg':340,'居家拖鞋.jpg':341,'屏风隔断.jpg':342,'展示告示.jpg':343,'山竹.jpg':344,'工业开关.jpg':345,'工业润滑油.jpg':346,'工装制服.jpg':347,'左旋肉碱.jpg':348,'巧克力.jpg':349,'布艺沙发.jpg':350,'平板电脑.jpg':351,'平板贴膜.jpg':352,'平衡车.jpg':353,'平面设计.jpg':354,'广告图文.jpg':355,'广告扇定制.jpg':356,'广告扑克牌.jpg':357,'广告牌.jpg':358,'广场舞.jpg':359,'床品套件.jpg':360,'床品配饰.jpg':361,'床垫.jpg':362,'床褥床垫.jpg':363,'建筑防尘网.jpg':364,'开关按钮.jpg':365,'开关插座.jpg':366,'开发板.jpg':367,'弹簧.jpg':368,'彩妆套装.jpg':369,'彩瞳.jpg':370,'影棚设备.jpg':371,'影音电器.jpg':372,'待产用品.jpg':373,'微单.jpg':374,'微波炉.jpg':375,'徽章定制.jpg':376,'心律失常.jpg':377,'心脑血管.jpg':378,'快递袋.jpg':379,'情侣T恤.jpg':380,'感冒咳嗽.jpg':381,'戏水玩具.jpg':382,'成人奶粉.jpg':383,'戒指.jpg':384,'户外庭院灯.jpg':385,'户外服装.jpg':386,'户外照明.jpg':387,'户外玩具.jpg':388,'户外秋千.jpg':389,'户外箱包.jpg':390,'户外装备.jpg':391,'户外露营.jpg':392,'户外鞋履.jpg':393,'户外饮水.jpg':394,'手串.jpg':395,'手写笔.jpg':396,'手办.jpg':397,'手套.jpg':398,'手套袖套.jpg':399,'手机充电器.jpg':400,'手机壳.jpg':401,'手机挂件.jpg':402,'手机支架.jpg':403,'手机流量卡.jpg':404,'手机电池.jpg':405,'手机维修.jpg':406,'手机耳机.jpg':407,'手机贴纸.jpg':408,'手机贴膜.jpg':409,'手机镜头.jpg':410,'手链.jpg':411,'手霜手膜.jpg':412,'打印复印机.jpg':413,'打底裤.jpg':414,'打火机.jpg':415,'扩孔钻.jpg':416,'扭扭车.jpg':417,'扳手.jpg':418,'投影幕布.jpg':419,'投票器.jpg':420,'抗菌消炎.jpg':421,'折叠午休床.jpg':422,'护具.jpg':423,'护发.jpg':424,'护栏隔离栏.jpg':425,'护理床.jpg':426,'护肝.jpg':427,'护肤套装.jpg':428,'抱枕坐垫.jpg':429,'抹胸.jpg':430,'拉丁爵士.jpg':431,'拖把扫把.jpg':432,'拳击散打.jpg':433,'拼装积木.jpg':434,'挂面.jpg':435,'指纹锁.jpg':436,'按摩椅.jpg':437,'挖掘机.jpg':438,'换气扇.jpg':439,'排卵试纸.jpg':440,'排球.jpg':441,'接线板.jpg':442,'搅拌机.jpg':443,'搬运车.jpg':444,'摄像头.jpg':445,'摄影周边.jpg':446,'摄影脚架.jpg':447,'摇铃安抚玩具.jpg':448,'摩托车.jpg':449,'摩托车配件.jpg':450,'支架.jpg':451,'支气管炎.jpg':452,'收纳盒.jpg':453,'收纳置物.jpg':454,'收纳袋.jpg':455,'收银纸.jpg':456,'教材教辅.jpg':457,'数据恢复.jpg':458,'数据线.jpg':459,'数码保护套.jpg':460,'数码收纳.jpg':461,'数码相机.jpg':462,'整机一体机.jpg':463,'整装设计.jpg':464,'文具收纳.jpg':465,'文创礼品.jpg':466,'文学社科.jpg':467,'文胸.jpg':468,'文胸套装.jpg':469,'料理机.jpg':470,'新奇糖果.jpg':471,'新车二手车.jpg':472,'方便粥饭.jpg':473,'方便菜.jpg':474,'方便面.jpg':475,'方向盘套.jpg':476,'施工除尘器.jpg':477,'旅行收纳.jpg':478,'旅行用品.jpg':479,'旅行箱.jpg':480,'旅行袋.jpg':481,'旗袍.jpg':482,'无人机.jpg':483,'无屏投影.jpg':484,'无线网卡.jpg':485,'无钢圈文胸.jpg':486,'日韩腕表.jpg':487,'早孕试纸.jpg':488,'早教故事机.jpg':489,'早餐奶.jpg':490,'早餐麦片.jpg':491,'时尚套装.jpg':492,'时尚女靴.jpg':493,'显示器.jpg':494,'显示屏.jpg':495,'普洱.jpg':496,'智能健康.jpg':497,'智能平衡车.jpg':498,'智能手表.jpg':499,'智能收银.jpg':500,'智能马桶盖.jpg':501,'暖奶消毒.jpg':502,'月嫂.jpg':503,'月饼.jpg':504,'服装定制.jpg':505,'服装店家具.jpg':506,'望远镜.jpg':507,'木床.jpg':508,'机用丝锥.jpg':509,'机能套装.jpg':510,'条码设备.jpg':511,'松花蛋.jpg':512,'枕头枕巾.jpg':513,'枕头被子.jpg':514,'果树.jpg':515,'果汁果泥.jpg':516,'架类.jpg':517,'枸杞.jpg':518,'染发.jpg':519,'柔道摔跤.jpg':520,'柚子.jpg':521,'柠檬.jpg':522,'栅栏篱笆.jpg':523,'标签定制.jpg':524,'标签机.jpg':525,'标签纸.jpg':526,'样图效果图.jpg':527,'桃胶.jpg':528,'桌游卡牌.jpg':529,'梨.jpg':530,'梳妆台桌.jpg':531,'棉衣.jpg':532,'棉衣棉服.jpg':533,'棉裤羽绒裤.jpg':534,'棒球.jpg':535,'棒球帽.jpg':536,'椭圆机.jpg':537,'榨汁机.jpg':538,'榴莲.jpg':539,'榻榻米.jpg':540,'模型.jpg':541,'橄榄球.jpg':542,'橱柜.jpg':543,'欧美腕表.jpg':544,'每日坚果.jpg':545,'毛呢大衣.jpg':546,'毛巾浴袍.jpg':547,'毛线帽.jpg':548,'毛绒抱枕.jpg':549,'毛衣.jpg':550,'毛衣针织衫.jpg':551,'气动元件.jpg':552,'气泡类包装.jpg':553,'气钉枪.jpg':554,'氨基葡萄糖.jpg':555,'氨糖.jpg':556,'水壶.jpg':557,'水杯.jpg':558,'水桶包.jpg':559,'水槽.jpg':560,'水泵.jpg':561,'水龙头.jpg':562,'汉服.jpg':563,'汽车坐垫.jpg':564,'汽车导航.jpg':565,'汽车油品.jpg':566,'汽车添加剂.jpg':567,'汽车装饰.jpg':568,'汽车车衣.jpg':569,'汽车轮胎.jpg':570,'汽车香氛.jpg':571,'沐浴清洁.jpg':572,'沐浴露.jpg':573,'油漆刷.jpg':574,'油漆涂料.jpg':575,'油烟机.jpg':576,'油烟机清洗.jpg':577,'泌尿系统.jpg':578,'泡菜.jpg':579,'洁面.jpg':580,'洋娃娃.jpg':581,'洋酒.jpg':582,'洒水壶.jpg':583,'洗发.jpg':584,'洗发水.jpg':585,'洗唛洗涤标.jpg':586,'洗手液.jpg':587,'洗澡用具.jpg':588,'洗碗机.jpg':589,'洗衣护理.jpg':590,'洗衣服务.jpg':591,'洗衣机.jpg':592,'洗衣机清洗.jpg':593,'洗衣液.jpg':594,'洗车工具.jpg':595,'洗鼻器.jpg':596,'流量充值.jpg':597,'浴刷.jpg':598,'浴室柜.jpg':599,'浴室用品.jpg':600,'浴室置物.jpg':601,'浴帽.jpg':602,'浴霸.jpg':603,'海参.jpg':604,'海鲜礼包.jpg':605,'海鲜贝壳.jpg':606,'涂色绘画.jpg':607,'消化不良.jpg':608,'消化道溃疡.jpg':609,'消毒柜.jpg':610,'消防灭火器.jpg':611,'润唇膏.jpg':612,'清洁剂.jpg':613,'清洁工具.jpg':614,'清洁电器.jpg':615,'清洗剂.jpg':616,'渔夫帽.jpg':617,'游戏围栏.jpg':618,'游戏机.jpg':619,'游泳装备.jpg':620,'游艺机.jpg':621,'湿巾.jpg':622,'滑板.jpg':623,'滑板车.jpg':624,'滑雪玩乐.jpg':625,'滑雪装备.jpg':626,'滴眼液.jpg':627,'漱口水.jpg':628,'潜水体验.jpg':629,'潜水用品.jpg':630,'火腿肠.jpg':631,'火锅烧烤.jpg':632,'火锅调料.jpg':633,'灯具安装.jpg':634,'灯具维修.jpg':635,'灯箱.jpg':636,'炉具.jpg':637,'炒货.jpg':638,'点胶机.jpg':639,'烘培器具.jpg':640,'烘干机.jpg':641,'烘焙套装.jpg':642,'烟灶消套装.jpg':643,'烤箱.jpg':644,'烤饼机.jpg':645,'烧烤用品.jpg':646,'烧烤野餐.jpg':647,'烫衣熨斗.jpg':648,'热水器.jpg':649,'热门考试.jpg':650,'烹饪厨具.jpg':651,'煎饼冷面.jpg':652,'照片书.jpg':653,'照片冲印.jpg':654,'照片打印机.jpg':655,'熟食.jpg':656,'燃气灶.jpg':657,'燕窝.jpg':658,'爬行垫.jpg':659,'爽肤水.jpg':660,'爽身止汗.jpg':661,'牙膏.jpg':662,'牛仔短裤.jpg':663,'牛仔裤.jpg':664,'牛仔长裤.jpg':665,'牛排.jpg':666,'牛肉.jpg':667,'牛肉丸.jpg':668,'牛肉卷.jpg':669,'牛肉干.jpg':670,'牛腱子.jpg':671,'物流纸箱.jpg':672,'特色腊味.jpg':673,'犬猫营养膏.jpg':674,'猕猴桃.jpg':675,'猪肉.jpg':676,'猫砂.jpg':677,'猫粮狗粮.jpg':678,'玩具枪.jpg':679,'珍珠.jpg':680,'球阀.jpg':681,'理发器.jpg':682,'理疗仪.jpg':683,'琥珀.jpg':684,'瑜伽垫.jpg':685,'瑜伽服.jpg':686,'瑞士腕表.jpg':687,'瓜皮帽.jpg':688,'瓷砖.jpg':689,'生活艺术.jpg':690,'生羊肉.jpg':691,'甲醛检测.jpg':692,'电动摩托车.jpg':693,'电动滑板车.jpg':694,'电动自行车.jpg':695,'电动车电池.jpg':696,'电动车装备.jpg':697,'电单车.jpg':698,'电压力锅.jpg':699,'电吹风.jpg':700,'电子琴.jpg':701,'电子线.jpg':702,'电容器.jpg':703,'电扇.jpg':704,'电机配件.jpg':705,'电机马达.jpg':706,'电池.jpg':707,'电滑板车.jpg':708,'电火锅.jpg':709,'电炖锅.jpg':710,'电热水壶.jpg':711,'电热管.jpg':712,'电焊.jpg电焊松香.jpg':713,'电焊松香.jpg':714,'电脑周边.jpg':715,'电脑桌书桌.jpg':716,'电脑椅.jpg':717,'电视机.jpg':718,'电话对讲.jpg':719,'电路板.jpg':720,'电钻.jpg':721,'电锅.jpg':722,'电锤钻头.jpg':723,'电饭煲.jpg':724,'男休闲皮鞋.jpg':725,'男士人字拖.jpg':726,'男士内裤.jpg':727,'男士剃须.jpg':728,'男士单肩包.jpg':729,'男士卫衣.jpg':730,'男士工装靴.jpg':731,'男士帆布鞋.jpg':732,'男士斜挎包.jpg':733,'男士泳衣.jpg':734,'男士洁面.jpg':735,'男士洞洞鞋.jpg':736,'男士真皮包.jpg':737,'男士网面鞋.jpg':738,'男士罗马鞋.jpg':739,'男士胸包.jpg':740,'男士腰包.jpg':741,'男士腰带.jpg':742,'男士豆豆鞋.jpg':743,'男士雨鞋.jpg':744,'男士马丁靴.jpg':745,'男正装皮鞋.jpg':746,'男沙滩凉鞋.jpg':747,'疤痕.jpg':748,'痔疮.jpg':749,'痛风.jpg':750,'瘦脸针.jpg':751,'百香果.jpg':752,'皮床.jpg':753,'皮肤消毒.jpg':754,'皮肤湿疹.jpg':755,'皮肤疱疹.jpg':756,'皮艺沙发.jpg':757,'皮草.jpg':758,'皮衣.jpg':759,'皮裤.jpg':760,'益智玩具.jpg':761,'益生菌.jpg':762,'盲盒.jpg':763,'省力拖把.jpg':764,'眉粉.jpg':765,'真菌感染.jpg':766,'眼影.jpg':767,'眼影眼线.jpg':768,'眼镜护理液.jpg':769,'眼霜.jpg':770,'睡衣.jpg':771,'睡袍.jpg':772,'睡裙.jpg':773,'睡裤.jpg':774,'睫毛膏.jpg':775,'短外套.jpg':776,'石榴.jpg':777,'研磨器.jpg':778,'硬盘.jpg':779,'碗筷餐具.jpg':780,'礼品包装.jpg':781,'礼品包装袋.jpg':782,'礼帽.jpg':783,'礼服汉服.jpg':784,'祛湿艾灸.jpg':785,'祛湿茶.jpg':786,'私处护理.jpg':787,'私处洗液.jpg':788,'种子种苗.jpg':789,'科学技术.jpg':790,'空手道.jpg':791,'空气净化器.jpg':792,'空调.jpg':793,'空调清洗.jpg':794,'窗.jpg':795,'窗帘门帘.jpg':796,'笔袋.jpg':797,'笔记本.jpg':798,'笔记本电脑.jpg':799,'筒灯.jpg':800,'管夹.jpg':801,'管接头.jpg':802,'篮球.jpg':803,'篮球鞋.jpg':804,'米其林美食.jpg':805,'粉丝米线.jpg':806,'粉底.jpg':807,'粉底液.jpg':808,'粘土玩具.jpg':809,'粽子.jpg':810,'精华.jpg':811,'糕点.jpg':812,'糖果.jpg':813,'糖盐.jpg':814,'红茶.jpg':815,'纤体酵素.jpg':816,'纸尿裤.jpg':817,'纸巾.jpg':818,'绅士男鞋.jpg':819,'经管励志.jpg':820,'结石.jpg':821,'继电器.jpg':822,'绿茶.jpg':823,'编织袋.jpg':824,'缝纫用品.jpg':825,'网球.jpg':826,'网红积木.jpg':827,'网红零食.jpg':828,'网络维护.jpg':829,'羊排.jpg':830,'羊肉卷.jpg':831,'羊蝎子.jpg':832,'美发器.jpg':833,'美容仪.jpg':834,'美甲.jpg':835,'美白丸.jpg':836,'美缝剂.jpg':837,'美背文胸.jpg':838,'羽毛球.jpg':839,'羽绒服.jpg':840,'翡翠.jpg':841,'翻译机.jpg':842,'老北京布鞋.jpg':843,'老花镜.jpg':844,'耳机耳麦.jpg':845,'耳饰.jpg':846,'肝炎.jpg':847,'肠胃消化.jpg':848,'肠胃炎.jpg':849,'肥料.jpg':850,'肥料饲料.jpg':851,'肾炎.jpg':852,'胆囊炎.jpg':853,'背带腰凳.jpg':854,'背心吊带.jpg':855,'背心马甲.jpg':856,'胎压表.jpg':857,'胶卷相机.jpg':858,'胶卷胶片.jpg':859,'胶原蛋白.jpg':860,'胸垫搭扣.jpg':861,'胸牌定做.jpg':862,'胸针.jpg':863,'脐橙.jpg':864,'脚垫.jpg':865,'脚链.jpg':866,'脱毛膏.jpg':867,'腰疼.jpg':868,'腹泻.jpg':869,'膳食纤维.jpg':870,'自封袋.jpg':871,'自拍杆.jpg':872,'自行车.jpg':873,'自驾游.jpg':874,'船袜.jpg':875,'艾灸.jpg':876,'节日用品.jpg':877,'节日装扮.jpg':878,'芭蕾舞.jpg':879,'花卉.jpg':880,'花园管.jpg':881,'花洒.jpg':882,'花瓶花器.jpg':883,'花艺用品.jpg':884,'花草茶.jpg':885,'英伦花草茶.jpg':886,'苹果.jpg':887,'苹果手机.jpg':888,'茶几花几.jpg':889,'茶叶礼盒.jpg':890,'草帽.jpg':891,'草莓.jpg':892,'荣耀9X.jpg':893,'荣耀V30.jpg':894,'荣耀手机.jpg':895,'菠萝蜜.jpg':896,'营养菌菇.jpg':897,'葡萄酒.jpg':898,'蒸箱.jpg':899,'蓄电池.jpg':900,'sp.jpg':901,'藏红花.jpg':902,'虾.jpg':903,'虾滑.jpg':904,'蛋白奶昔.jpg':905,'蜂蜜.jpg':906,'蜜饯果干.jpg':907,'螺丝批.jpg':908,'血压计.jpg':909,'血糖用品.jpg':910,'行车记录仪.jpg':911,'衣架裤架.jpg':912,'补气补血.jpg':913,'补益安神.jpg':914,'补肾.jpg':915,'补胎工具.jpg':916,'补钙.jpg':917,'衬衫.jpg':918,'袜子.jpg':919,'被子被芯.jpg':920,'装订用品.jpg':921,'西服.jpg':922,'西服套装.jpg':923,'西装.jpg':924,'西装裤.jpg':925,'西裤.jpg':926,'观赏鱼.jpg':927,'解热镇痛.jpg':928,'设计素材.jpg':929,'话费充值.jpg':930,'课桌椅.jpg':931,'调味酱.jpg':932,'豆干.jpg':933,'豆浆奶茶.jpg':934,'贝雷帽.jpg':935,'财会用品.jpg':936,'起重工具.jpg':937,'超市家具.jpg':938,'足浴足疗.jpg':939,'足球.jpg':940,'跆拳道.jpg':941,'跌打损伤.jpg':942,'跑步机.jpg':943,'跑步鞋.jpg':944,'路亚钓.jpg':945,'路由器.jpg':946,'身体乳.jpg':947,'车内用品.jpg':948,'车内置物.jpg':949,'车刀.jpg':950,'车厘子.jpg':951,'车用吸尘器.jpg':952,'车用密封条.jpg':953,'车用氧吧.jpg':954,'车用灭火器.jpg':955,'车用电器.jpg':956,'车蜡车膜.jpg':957,'车载充气泵.jpg':958,'车载充电器.jpg':959,'车载冷热箱.jpg':960,'车载手机架.jpg':961,'车载支架.jpg':962,'车零配件.jpg':963,'轮椅.jpg':964,'轮滑.jpg':965,'轴承.jpg':966,'辅酶Q10.jpg':967,'辅食奶粉储存.jpg':968,'辅食料理机.jpg':969,'辅食零食.jpg':970,'过家家玩具.jpg':971,'运动T恤.jpg':972,'运动包.jpg':973,'运动卫衣.jpg':974,'运动套装.jpg':975,'运动帽.jpg':976,'运动手表.jpg':977,'运动文胸.jpg':978,'运动棉羽.jpg':979,'运动短裤.jpg':980,'运动茄克.jpg':981,'运动袜.jpg':982,'运动长裤.jpg':983,'进口原版.jpg':984,'连体衣.jpg':985,'连接器.jpg':986,'连衣裙.jpg':987,'连裤袜.jpg':988,'速冻面点.jpg':989,'道路安全.jpg':990,'遥控玩具.jpg':991,'遮光网.jpg':992,'遮阳帽.jpg':993,'避孕套.jpg':994,'酒杯.jpg':995,'酒精测试仪.jpg':996,'酒醋酱油.jpg':997,'酱菜.jpg':998,'酵素.jpg':999,'酸奶.jpg':1000,'针织运动裤.jpg':1001,'钢材.jpg':1002,'钢琴.jpg':1003,'钢笔.jpg':1004,'钥匙扣礼品.jpg':1005,'钱包.jpg':1006,'钳子.jpg':1007,'钻石.jpg':1008,'铝材.jpg':1009,'铣刀.jpg':1010,'银屑病.jpg':1011,'链条包.jpg':1012,'锅具汤煲.jpg':1013,'键盘膜.jpg':1014,'镜子梳子.jpg':1015,'门.jpg':1016,'防冻液.jpg':1017,'防尘保护罩.jpg':1018,'防尘塞.jpg':1019,'防尘用具.jpg':1020,'防护救生.jpg':1021,'防护用品.jpg':1022,'防撞条.jpg':1023,'防晒.jpg':1024,'防晒袖.jpg':1025,'防水材料.jpg':1026,'防溢乳垫.jpg':1027,'防脱发.jpg':1028,'防蓝光眼镜.jpg':1029,'防蛀灭虫.jpg':1030,'防血栓.jpg':1031,'防走丢绳.jpg':1032,'阳台晾晒.jpg':1033,'阿胶.jpg':1034,'陈列展柜.jpg':1035,'降温用品.jpg':1036,'降血压.jpg':1037,'降血糖.jpg':1038,'降血脂.jpg':1039,'限量潮鞋.jpg':1040,'除味剂.jpg':1041,'除螨仪.jpg':1042,'随身听.jpg':1043,'隔尿垫.jpg':1044,'隔离.jpg':1045,'隔音隔热.jpg':1046,'集成吊顶.jpg':1047,'集成电路.jpg':1048,'雨具.jpg':1049,'雪纺衫.jpg':1050,'零食大礼包.jpg':1051,'雷锋帽.jpg':1052,'雾化器.jpg':1053,'面包机.jpg':1054,'面点原料.jpg':1055,'面粉.jpg':1056,'面膜.jpg':1057,'鞋用品.jpg':1058,'鞋配件.jpg':1059,'鞋靴护理.jpg':1060,'音箱.jpg':1061,'项链.jpg':1062,'风湿关节.jpg':1063,'风衣.jpg':1064,'食用油.jpg':1065,'餐桌.jpg':1066,'餐桌布艺.jpg':1067,'餐饮家具.jpg':1068,'饮料.jpg':1069,'饮用水.jpg':1070,'饲料.jpg':1071,'饼干.jpg':1072,'香水.jpg':1073,'香皂.jpg':1074,'香薰用品.jpg':1075,'香薰蜡烛.jpg':1076,'马甲.jpg':1077,'驱虫用品.jpg':1078,'驱蚊灭鼠.jpg':1079,'驱蚊用品.jpg':1080,'骑士护具.jpg':1081,'骑士服饰.jpg':1082,'骑行装备.jpg':1083,'骨质疏松.jpg':1084,'高尔夫.jpg':1085,'魅族手机.jpg':1086,'鱼.jpg':1087,'鱼丸，鱼滑.jpg':1088,'鱼干虾干.jpg':1089,'鱼油.jpg':1090,'鱿鱼干.jpg':1091,'鲜奶.jpg':1092,'鸡.jpg':1093,'鸡蛋.jpg':1094,'鸭蛋.jpg':1095,'麦克风.jpg':1096,'麦片.jpg':1097,'麻花钻.jpg':1098,'黄金.jpg':1099,'黑茶白茶.jpg':1100,'鼠标键盘.jpg':1101,'鼻毛修剪器.jpg':1102,'鼻炎.jpg':1103,'鼻贴.jpg':1104,'齿轮.jpg':1105},
      }
    },
    methods:{
        toSubmenu(str){
            let id = [];
            id.push(str)
            this.$router.push({
                path: `/submentus`,
                query:{
                    id:JSON.stringify('['+str+']')
                }
            })
        },
        //跳转商品详情
        toDetail(){
            console.log(this.banerimage,'this.banerimage');
            this.$router.push({
                // path: `/details/${this.banerimage.url}`,
            })
            console.log('这个是地址',)

        }
    }
}
</script>
<style scoped>
img {
  width: 100%;
}
.imgurls{
  width: 100%;
  height: auto;
  display: block;
  border-radius: 6px;
}
.header {
  width: 100%;
  height: auto;
  display: block;
  margin-top: 0.5rem;
}
.nav {
  width: 100%;
  display: flex;
  flex-wrap: wrap;
}
.nav > div {
  width: 33%;
  margin: 0.3rem 0;
  display: flex;
  flex-direction: column;
  align-items: center;
  justify-content: space-around;
}
.nav_img {
  width: 85%;
}
</style>
